docs/notes/configuration_languages.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Configuration Languages</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Configuration Languages</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgea5bfd3">JSON</a></li>
<li><a href="#org6efeb25">YAML</a></li>
<li><a href="#org85a5b2a">Dhall</a></li>
<li><a href="#org39feba2">EDN</a></li>
<li><a href="#orgb8b3733">Protobuf</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgea5bfd3" class="outline-2">
<h2 id="orgea5bfd3"><a href="#orgea5bfd3">JSON</a></h2>
</div>

<div id="outline-container-org6efeb25" class="outline-2">
<h2 id="org6efeb25"><a href="#org6efeb25">YAML</a></h2>
</div>

<div id="outline-container-org85a5b2a" class="outline-2">
<h2 id="org85a5b2a"><a href="#org85a5b2a">Dhall</a></h2>
<div class="outline-text-2" id="text-org85a5b2a">
<p>
<a href="https://dhall-lang.org">https://dhall-lang.org</a>
</p>

<p>
Supports variables, functions, and types.
</p>

<p>
Opinion: the syntax is cluttered. Even in the hand-picked example on the
homepage, which compares Dhall to JSON and YAML, I think many people would say
that the JSON and YAML are so much nicer.
</p>
</div>
</div>

<div id="outline-container-org39feba2" class="outline-2">
<h2 id="org39feba2"><a href="#org39feba2">EDN</a></h2>
</div>

<div id="outline-container-orgb8b3733" class="outline-2">
<h2 id="orgb8b3733"><a href="#orgb8b3733">Protobuf</a></h2>
<div class="outline-text-2" id="text-orgb8b3733">
<p>
Not a "configuration" language. But it can be used to declare domain models.
</p>
</div>
</div>
</div>
</body>
</html>